# В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растёт на круглой грядке, причём кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — 
# на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, 
# которое может собрать за один заход собирающий модуль, 
# находясь перед некоторым кустом заданной во входном файле грядки.

import os
def clear_console(): os.system('cls')
clear_console()
size = int(input("Введите колличество кустов на грядке: "))

list1 = []
for i in range(size):
    
    list1.append(int(input(f"Введите колличество ягод на {i+1} кусте: ")))


max_result = 0
sum_i = 0
for i in range(1,len(list1)-1):
    sum_i = list1[i-1]+list1[i]+list1[i+1]
    if max_result<sum_i:
        max_result = sum_i
print(max_result)